[
    {
        "scenarioNumber": 1,
        "title": "AITA for eating the toppings off my bfs pizza?",
        "body": "Earlier tonight I ordered a Hawaiian pizza with my boyfriend. We’ve only been dating a month so it’s the first time I ate pizza with him. We only finished about half, and then we went to watch TV. I was still hungry, so I ate all the toppings off the pizza.When he saw, he absolutely flipped out. He said that he was saving it for lunch tomorrow, that he had never met anyone who would do anything like this, and was just generally really upset. I thought he was joking and laughed it off, but it’s been a couple hours and he is still upset. He’s talking about how he was looking forwards to having the leftover pizza for lunch, and now I’ve ruined his lunch.I offered to buy him another pizza, but he kept saying that it wasn’t about that, and I just ruined his day. Is he overreacting or AITA?"
    },
    {
        "scenarioNumber": 2,
        "title": "AITA for not allowing my 17yo to be taken advantage of?",
        "body": "I recently had to make a difficult decision regarding my 17-year-old child, whom I will refer to as B. My sister invited B on a vacation to Benidorm with her family, which I was initially thrilled about. However, I recently learned that my sister was expecting B to babysit her children during the vacation, without B offering or being asked to do so. This came as a shock to me, especially since B is autistic and can be easily manipulated. When I confronted my sister about this, she told me that B could say no, but I didn't feel comfortable with the situation and ultimately had to tell B that they couldn't go on the trip. My sister and her husband were angry with me, but B ultimately made the decision not to go, as they would prefer to have fun rather than babysit their cousins. While some family members think I'm being too protective, I believe I made the right decision for my child. AITA?"
    },
    {
        "scenarioNumber": 3,
        "title": "AITA for wanting to keep the puppies that also belong to my neighbor's?",
        "body": "During my absence,my grandfather briefly let my dog out in the backyard, but he didn't realize that my neighbor's dog was also there. Somehow, they mated without anyone noticing, even though my dog typically barks at other dogs. According to my father, my neighbor deliberately waited for his dog to mate with mine and didn't intervene.A few weeks later, my dog gave birth to five adorable and healthy puppies that resemble both parents.When my neighbor found out, he demanded that I give him one of the puppies since his dog was the father. However,I refused because he never asked for permission or took any responsibility for his dog or mine during or after the pregnancy.Additionally, he doesn't have a proper environment or lifestyle for raising a puppy and feeds his dog unhealthy human food.I don't want to give up any of the puppies because they are part of my family now, and I love them all equally. Separating them from their mother and siblings would be traumatic, and they are too young to be weaned or separated at four weeks old. My neighbor leaves his dog outside without shelter or attention,so I feel like I am making the best decision for the puppies. AITA?"
    },
    {
        "scenarioNumber": 4,
        "title": "AITA for dumping my teenage daughter's dinner in the trash after she was rude to me?",
        "body": "I'm using a throwaway account because of obvious reasons. As a single dad (44) to two kids, Audrey (16) and Emily (12), we have a great relationship, but Audrey can sometimes be rude and demeaning. This behavior is concerning, as Emily often mimics her older sister. During a recent Sunday dinner, Audrey came downstairs in a bad mood and began being a downer. I asked her to improve her mood, but she unleashed her anger at me, saying hurtful things. I took her plate and threw it away, telling her to start providing for herself since she couldn't show me basic respect. She got upset and ran to her room. We haven't talked since. Now, Emily is also upset with me, claiming that I acted like a jerk to her sister. I don't feel like I yelled, but I couldn't tolerate being spoken to with such disrespect. AITA?"
    },
    {
        "scenarioNumber": 5,
        "title": "AITA for kicking my sisters friends daughter off my Crunchyroll account?",
        "body": "I used to work with my sister, Anne, and her friend, Betty, at a fast food joint. Betty and I became close friends, and one day, she mentioned her daughter's love for anime and the struggle of finding them on Netflix. I offered to let her use my Crunchyroll premium account.A few months later, Anne and I got into a minor argument. Being pregnant and hormonal, Anne overreacted and transferred me to another store. Betty, who saw us arguing, stopped talking to me. I felt hurt by her sudden coldness towards me, so I changed my Crunchyroll password to prevent Betty's daughter from using it. If Betty won't talk to me, why should I give her something that I pay for?Betty's daughter eventually noticed the password change and got upset. Instead of messaging me, Betty blocked me on everything and complained to my sister, who scolded me for it. I think that if it's essential to her daughter, Betty can afford to pay for it herself, given her financial status. AITA?"
    }
]